EDT/УТ/src/Documents/ВводДанныхГСМ/ВводДанныхГСМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВводДанныхГСМ</name>
  <registerRecords>AccumulationRegister.РасходГСМ</registerRecords>
  <registerRecords>InformationRegister.СтоимостьГСМ</registerRecords>
  <registerRecords>InformationRegister.ВводДанныхОРасходахКомпании</registerRecords>
  <attributes>
    <name>ДатаОтчета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТерминалДоставки</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Транспорт</name>
    <attributes>
      <name>Рейс</name>
      <type>
        <types>DocumentRef.Рейс</types>
      </type>
    </attributes>
    <attributes>
      <name>Транспорт</name>
      <type>
        <types>CatalogRef.новаТранспорт</types>
      </type>
    </attributes>
    <attributes>
      <name>Водитель</name>
      <type>
        <types>CatalogRef.новаВодители</types>
      </type>
    </attributes>
    <attributes>
      <name>РасходГСМ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПоказанияОдометраНаНачалоДня</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПоказанияОдометраНаКонецДня</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СтоимостьГСМ</name>
    <attributes>
      <name>ТипГСМ</name>
      <type>
        <types>CatalogRef.ТипыГСМ</types>
      </type>
    </attributes>
    <attributes>
      <name>Стоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/AccumulationRegisters/РасходГСМ/РасходГСМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РасходГСМ</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>РасходГСМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаЗатрат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ПоказанияОдометраНаНачалоДня</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказанияОдометраНаКонецДня</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Рейс</name>
    <type>
      <types>DocumentRef.Рейс</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.новаТранспорт</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.новаВодители</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТерминалДоставки</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

EDT/УТ/src/InformationRegisters/СтоимостьГСМ/СтоимостьГСМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтоимостьГСМ</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ТипГСМ</name>
    <type>
      <types>CatalogRef.ТипыГСМ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТерминалДоставки</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Documents/Рейс/Рейс.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Рейс</name>
  <registerRecords>InformationRegister.РейсыЗаказов</registerRecords>
  <attributes>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.ТипыТранспортовВероут</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПалетты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РежимЗагрузкиДанных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РейсМестнойДоставки</name>
    <type>
      <types>BusinessProcessRef.новаРейсМестнойДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРейса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>axi_Загрузка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТерминалДоставки</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>УдаленноеЗакрытиеРейса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>vr_РаспределительныйЦентр</name>
    <type>
      <types>CatalogRef.РаспределительныеЦентрыVeeroute</types>
    </type>
  </attributes>
  <attributes>
    <name>МетодикаМаршрутизации</name>
    <type>
      <types>EnumRef.МетодикаЛогистическойМаршрутизации</types>
    </type>
  </attributes>
  <attributes>
    <name>РольРейса</name>
    <type>
      <types>CatalogRef.РолиТранспорта</types>
    </type>
  </attributes>
  <attributes>
    <name>СменаРейса</name>
    <type>
      <types>CatalogRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДоставок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЗаборов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВнешнийОператорМаршрутизации</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Точки</name>
    <attributes>
      <name>НомерПоездки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипРасположения</name>
      <type>
        <types>EnumRef.ТипыРасположенияТочки</types>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеТочки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресТочки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Широта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>13</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Долгота</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>13</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПланируемоеВремяПрибытия</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ПланируемаяВремяОтправления</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ПлановоеРасстояние</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактическийПробег</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяДвиженияПоПлану</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяДвиженияФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗапланированнаяДлительностьОстановки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактическаяДлительностьОстановки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РасчетноеВремяПрибытия</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>РасчетноеВремяУбытия</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Заказы</name>
    <attributes>
      <name>НомерПоездки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусЗаказа</name>
      <type>
        <types>CatalogRef.СтатусыЗаказовВероут</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЗаказа</name>
      <type>
        <types>EnumRef.ВидыЗаказовВероут</types>
      </type>
    </attributes>
    <attributes>
      <name>ПродолжительностьОперации</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.ЗаборТовара</types>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказДобавленВРучную</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>УдаленИзРейса</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗагруженИзВероут</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИндивидуальнаяМаршрутизация</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказДобавленВЗапланированныйРейс</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Поездки</name>
    <attributes>
      <name>НомерПоездки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПоездки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПланируемаяДистанция</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПланируемаяПродолжительностьПоездки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПланируемоеВремяНачалаПоездки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ПланируемоеВремяОкончанияПоездки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяНачалаДоступностиВодителя</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОкончанияДоступностиВодителя</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбщийВес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбщийОбъем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьПоездки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/Documents/ВводДанныхГСМ/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ЗаполнитьТранспортНаСервере()
	
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Рейс.РейсМестнойДоставки.Транспорт КАК РейсМестнойДоставкиТранспорт,
	                      |	Рейс.РейсМестнойДоставки.Водитель КАК РейсМестнойДоставкиВодитель,
	                      |	Рейс.Ссылка КАК Рейс
	                      |ПОМЕСТИТЬ ВТ_Рейсы
	                      |ИЗ
	                      |	Документ.Рейс КАК Рейс
	                      |ГДЕ
	                      |	Рейс.Дата МЕЖДУ &Дата1 И &Дата2
	                      |	И Рейс.Проведен
	                      |	И Рейс.ТерминалДоставки = &ТерминалДоставки
	                      |	И Рейс.РейсМестнойДоставки.Водитель.Наемный = ЛОЖЬ
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	Рейс.РейсМестнойДоставки.Водитель,
	                      |	Рейс.РейсМестнойДоставки.Транспорт,
	                      |	Рейс.Ссылка
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	ЗаборТовара.Транспорт,
	                      |	ЗаборТовара.Водитель,
	                      |	РейсЗаказы.Ссылка
	                      |ИЗ
	                      |	Документ.ЗаборТовара КАК ЗаборТовара
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Рейс.Заказы КАК РейсЗаказы
	                      |		ПО ЗаборТовара.Ссылка = РейсЗаказы.Заказ
	                      |ГДЕ
	                      |	ЗаборТовара.Дата МЕЖДУ &Дата1 И &Дата2
	                      |	И ЗаборТовара.Проведен
	                      |	И ЗаборТовара.ТерминалДоставки = &ТерминалДоставки
	                      |	И ЗаборТовара.Водитель.Наемный = ЛОЖЬ
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ЗаборТовара.Транспорт,
	                      |	ЗаборТовара.Водитель,
	                      |	РейсЗаказы.Ссылка
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	Фрахт.Транспорт,
	                      |	Фрахт.Водитель,
	                      |	ЗНАЧЕНИЕ(Документ.Рейс.ПустаяСсылка)
	                      |ИЗ
	                      |	Документ.Фрахт КАК Фрахт
	                      |ГДЕ
	                      |	Фрахт.Дата МЕЖДУ &Дата1 И &Дата2
	                      |	И Фрахт.Проведен
	                      |	И Фрахт.Терминал = &ТерминалДоставки
	                      |	И Фрахт.Водитель.Наемный = ЛОЖЬ
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	Фрахт.Транспорт,
	                      |	Фрахт.Водитель
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТ_Рейсы.РейсМестнойДоставкиТранспорт,
	                      |	ВТ_Рейсы.РейсМестнойДоставкиВодитель,
	                      |	ВТ_Рейсы.Рейс
	                      |ПОМЕСТИТЬ ВТ_ЗаказыГруппировка
	                      |ИЗ
	                      |	ВТ_Рейсы КАК ВТ_Рейсы
	                      |ГДЕ
	                      |	НЕ ВТ_Рейсы.РейсМестнойДоставкиТранспорт ЕСТЬ NULL 
	                      |	И ВТ_Рейсы.РейсМестнойДоставкиТранспорт <> ЗНАЧЕНИЕ(Справочник.новаТранспорт.ПустаяСсылка)
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ВТ_Рейсы.РейсМестнойДоставкиТранспорт,
	                      |	ВТ_Рейсы.РейсМестнойДоставкиВодитель,
	                      |	ВТ_Рейсы.Рейс
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	МАКСИМУМ(ТранспортыРасходГСМ.Период) КАК Период,
	                      |	ТранспортыРасходГСМ.Транспорт,
	                      |	ТранспортыРасходГСМ.Рейс
	                      |ПОМЕСТИТЬ ВТ_КрайняяДата
	                      |ИЗ
	                      |	РегистрНакопления.РасходГСМ КАК ТранспортыРасходГСМ
	                      |ГДЕ
	                      |	ТранспортыРасходГСМ.ТерминалДоставки = &ТерминалДоставки
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ТранспортыРасходГСМ.Транспорт,
	                      |	ТранспортыРасходГСМ.Рейс
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ДанныеРасходГСМ.Транспорт,
	                      |	ДанныеРасходГСМ.ПоказанияОдометраНаКонецДня,
	                      |	ДанныеРасходГСМ.Рейс
	                      |ПОМЕСТИТЬ ВТ_КрайниеПоказания
	                      |ИЗ
	                      |	ВТ_КрайняяДата КАК ВТ_КрайняяДата
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасходГСМ КАК ДанныеРасходГСМ
	                      |		ПО ВТ_КрайняяДата.Транспорт = ДанныеРасходГСМ.Транспорт
	                      |			И ВТ_КрайняяДата.Период = ДанныеРасходГСМ.Период
	                      |			И ВТ_КрайняяДата.Рейс = ДанныеРасходГСМ.Рейс
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	ВТ_ЗаказыГруппировка.РейсМестнойДоставкиТранспорт КАК Транспорт,
	                      |	ВТ_ЗаказыГруппировка.РейсМестнойДоставкиВодитель КАК Водитель,
	                      |	ВТ_КрайниеПоказания.ПоказанияОдометраНаКонецДня КАК ПоказанияОдометраНаНачалоДня
	                      |ИЗ
	                      |	ВТ_ЗаказыГруппировка КАК ВТ_ЗаказыГруппировка
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КрайниеПоказания КАК ВТ_КрайниеПоказания
	                      |		ПО ВТ_ЗаказыГруппировка.РейсМестнойДоставкиТранспорт = ВТ_КрайниеПоказания.Транспорт
	                      |			И ВТ_ЗаказыГруппировка.Рейс = ВТ_КрайниеПоказания.Рейс");
	
	
	
	//Запрос = Новый Запрос("ВЫБРАТЬ
	//                      |	новаОтчетВодителя.Транспорт КАК РейсМестнойДоставкиТранспорт,
	//                      |	новаОтчетВодителя.Водитель КАК РейсМестнойДоставкиВодитель,
	//                      |	новаОтчетВодителя.Рейс КАК Рейс
	//                      |ПОМЕСТИТЬ ВТ_Рейсы
	//                      |ИЗ
	//                      |	Документ.новаОтчетВодителя КАК новаОтчетВодителя
	//                      |ГДЕ
	//                      |	новаОтчетВодителя.Дата МЕЖДУ &Дата1 И &Дата2
	//                      |	И новаОтчетВодителя.Проведен
	//                      |	И новаОтчетВодителя.Транспорт.НаёмныйТранспорт = ЛОЖЬ
	//                      |	И новаОтчетВодителя.Транспорт.ТерминалДоставки = &ТерминалДоставки
	//                      |
	//                      |СГРУППИРОВАТЬ ПО
	//                      |	новаОтчетВодителя.Транспорт,
	//                      |	новаОтчетВодителя.Водитель,
	//                      |	новаОтчетВодителя.Рейс
	//                      |
	//                      |ОБЪЕДИНИТЬ ВСЕ
	//                      |
	//                      |ВЫБРАТЬ
	//                      |	Фрахт.Транспорт,
	//                      |	Фрахт.Водитель,
	//                      |	ЗНАЧЕНИЕ(Документ.рейс.пустаяСсылка)
	//                      |ИЗ
	//                      |	Документ.Фрахт КАК Фрахт
	//                      |ГДЕ
	//                      |	Фрахт.Дата МЕЖДУ &Дата1 И &Дата2
	//                      |	И Фрахт.Проведен
	//                      |	И Фрахт.Терминал = &ТерминалДоставки
	//                      |	И Фрахт.Транспорт.НаёмныйТранспорт = ЛОЖЬ
	//                      |
	//                      |СГРУППИРОВАТЬ ПО
	//                      |	Фрахт.Транспорт,
	//                      |	Фрахт.Водитель
	//                      |;
	//                      |
	//                      |////////////////////////////////////////////////////////////////////////////////
	//                      |ВЫБРАТЬ
	//                      |	ВТ_Рейсы.РейсМестнойДоставкиТранспорт,
	//                      |	ВТ_Рейсы.РейсМестнойДоставкиВодитель,
	//                      |	ВТ_Рейсы.Рейс
	//                      |ПОМЕСТИТЬ ВТ_ЗаказыГруппировка
	//                      |ИЗ
	//                      |	ВТ_Рейсы КАК ВТ_Рейсы
	//                      |ГДЕ
	//                      |	НЕ ВТ_Рейсы.РейсМестнойДоставкиТранспорт ЕСТЬ NULL 
	//                      |	И ВТ_Рейсы.РейсМестнойДоставкиТранспорт <> ЗНАЧЕНИЕ(Справочник.новаТранспорт.ПустаяСсылка)
	//                      |
	//                      |СГРУППИРОВАТЬ ПО
	//                      |	ВТ_Рейсы.РейсМестнойДоставкиТранспорт,
	//                      |	ВТ_Рейсы.РейсМестнойДоставкиВодитель,
	//                      |	ВТ_Рейсы.Рейс
	//                      |;
	//                      |
	//                      |////////////////////////////////////////////////////////////////////////////////
	//                      |ВЫБРАТЬ
	//                      |	МАКСИМУМ(ТранспортыРасходГСМ.Период) КАК Период,
	//                      |	ТранспортыРасходГСМ.Транспорт,
	//                      |	ТранспортыРасходГСМ.Рейс
	//                      |ПОМЕСТИТЬ ВТ_КрайняяДата
	//                      |ИЗ
	//                      |	РегистрНакопления.РасходГСМ КАК ТранспортыРасходГСМ
	//                      |ГДЕ
	//                      |	ТранспортыРасходГСМ.ТерминалДоставки = &ТерминалДоставки
	//                      |
	//                      |СГРУППИРОВАТЬ ПО
	//                      |	ТранспортыРасходГСМ.Транспорт,
	//                      |	ТранспортыРасходГСМ.Рейс
	//                      |;
	//                      |
	//                      |////////////////////////////////////////////////////////////////////////////////
	//                      |ВЫБРАТЬ
	//                      |	ДанныеРасходГСМ.Транспорт,
	//                      |	ДанныеРасходГСМ.ПоказанияОдометраНаКонецДня,
	//                      |	ДанныеРасходГСМ.Рейс
	//                      |ПОМЕСТИТЬ ВТ_КрайниеПоказания
	//                      |ИЗ
	//                      |	ВТ_КрайняяДата КАК ВТ_КрайняяДата
	//                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасходГСМ КАК ДанныеРасходГСМ
	//                      |		ПО ВТ_КрайняяДата.Транспорт = ДанныеРасходГСМ.Транспорт
	//                      |			И ВТ_КрайняяДата.Период = ДанныеРасходГСМ.Период
	//                      |			И ВТ_КрайняяДата.Рейс = ДанныеРасходГСМ.Рейс
	//                      |;
	//                      |
	//                      |////////////////////////////////////////////////////////////////////////////////
	//                      |ВЫБРАТЬ РАЗЛИЧНЫЕ
	//                      |	ВТ_ЗаказыГруппировка.РейсМестнойДоставкиТранспорт КАК Транспорт,
	//                      |	ВТ_ЗаказыГруппировка.РейсМестнойДоставкиВодитель КАК Водитель,
	//                      |	ВТ_КрайниеПоказания.ПоказанияОдометраНаКонецДня КАК ПоказанияОдометраНаНачалоДня
	//                      |ИЗ
	//                      |	ВТ_ЗаказыГруппировка КАК ВТ_ЗаказыГруппировка
	//                      |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КрайниеПоказания КАК ВТ_КрайниеПоказания
	//                      |		ПО ВТ_ЗаказыГруппировка.РейсМестнойДоставкиТранспорт = ВТ_КрайниеПоказания.Транспорт");
						  
	Запрос.УстановитьПараметр("Дата1", НачалоДня(Объект.ДатаОтчета));
	Запрос.УстановитьПараметр("Дата2", КонецДня(Объект.ДатаОтчета));
	Запрос.УстановитьПараметр("ТерминалДоставки", Объект.ТерминалДоставки);
	РезТЗ = Запрос.Выполнить().Выгрузить();
	
	

	Объект.Транспорт.Загрузить(РезТЗ);
	
								   
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТранспорт(Команда)
	
	Если ЗначениеЗаполнено(Объект.ТерминалДоставки) Тогда
		Если ЗначениеЗаполнено(Объект.ДатаОтчета) Тогда
	
			Если Объект.Транспорт.Итог("РасходГСМ") > 0 ИЛИ Объект.Транспорт.Итог("ПоказанияОдометраНаКонецДня") > 0 Тогда
			
				#Если Клиент Тогда
					Режим = РежимДиалогаВопрос.ДаНет;
					Ответ = Вопрос(НСтр("ru = 'В табличную часть были внесены данные, очистить и заполнить заново?';"
					     + " en = 'Do you want to continue?'"), Режим, 0);
					Если Ответ = КодВозвратаДиалога.Нет Тогда
					    Возврат;
					ИначеЕсли Ответ = КодВозвратаДиалога.Да Тогда
						Объект.Транспорт.Очистить();
						ЗаполнитьТранспортНаСервере();
					КонецЕсли; 
				#Иначе
					Объект.Транспорт.Очистить();
					ЗаполнитьТранспортНаСервере();
				#КонецЕсли	
			
			Иначе
			    Объект.Транспорт.Очистить();
				ЗаполнитьТранспортНаСервере();		
			КонецЕсли;		
			
		Иначе
	        Сообщить("Не заполнена ""дата отчета""");
		КонецЕсли;			
	Иначе
		Сообщить("Не заполнен терминал доставки");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтоимостиНаСервере()
	
	Запрос = Новый Запрос("ВЫБРАТЬ
                       |	СтоимостьГСМСрезПоследних.ТипГСМ,
                       |	СтоимостьГСМСрезПоследних.Стоимость
                       |ИЗ
                       |	РегистрСведений.СтоимостьГСМ.СрезПоследних(&Период, ) КАК СтоимостьГСМСрезПоследних
                       |ГДЕ
                       |	СтоимостьГСМСрезПоследних.ТерминалДоставки = &ТерминалДоставки");
	Запрос.УстановитьПараметр("Период", Объект.ДатаОтчета);
	Запрос.УстановитьПараметр("ТерминалДоставки", Объект.ТерминалДоставки);
	РезТЗ = Запрос.Выполнить().Выгрузить();
	
	Объект.СтоимостьГСМ.Загрузить(РезТЗ);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСтоимости(Команда)
	
	Если ЗначениеЗаполнено(Объект.ТерминалДоставки) Тогда
		
		Если ЗначениеЗаполнено(Объект.ДатаОтчета) Тогда
			
			Если Объект.СтоимостьГСМ.Количество() Тогда
				#Если Клиент Тогда
					Режим = РежимДиалогаВопрос.ДаНет;
					Ответ = Вопрос(НСтр("ru = 'Табличная часть не пуста. Очистить и заполнить заново?';"
					     + " en = 'Do you want to continue?'"), Режим, 0);
					Если Ответ = КодВозвратаДиалога.Нет Тогда
					    Возврат;
					ИначеЕсли Ответ = КодВозвратаДиалога.Да Тогда
						Объект.СтоимостьГСМ.Очистить();
						ЗаполнитьСтоимостиНаСервере();
					КонецЕсли; 
				#Иначе
					Объект.СтоимостьГСМ.Очистить();
					ЗаполнитьСтоимостиНаСервере();
				#КонецЕсли
			Иначе
				ЗаполнитьСтоимостиНаСервере();
			КонецЕсли;
		Иначе
	        Сообщить("Не заполнена ""дата отчета""");
		КонецЕсли;
			
	Иначе
		Сообщить("Не заполнен терминал доставки");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда	
		Объект.ДатаОтчета = НачалоДня(ТекущаяДата() - 86400);		
	КонецЕсли;	
	
	Объект.ТерминалДоставки = Справочники.РегиональныеТерминалы.МоскваСтриж;
	
КонецПроцедуры

&НаКлиенте
Процедура ТранспортПередУдалением(Элемент, Отказ)
	
	ТекСтрока = Элементы.Транспорт.ТекущиеДанные;
	Парам = Новый Структура("ТекСтрока", ТекСтрока);
	ПоказатьВопрос(Новый ОписаниеОповещения("ОбработкаУдалениеСтроки",ЭтотОбъект, Парам), "Удалить строку?", РежимДиалогаВопрос.ДаНет);
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаУдалениеСтроки(РезВопроса, Парам) Экспорт
	
	СтрокаДляУдаления = Парам.ТекСтрока;
	Если РезВопроса = КодВозвратаДиалога.Да Тогда	
		Объект.Транспорт.Удалить(Объект.Транспорт.Индекс(СтрокаДляУдаления));			
	Иначе	
	КонецЕсли;	

КонецПроцедуры


&НаКлиенте
Процедура ТранспортПослеУдаления(Элемент)
	
	Элементы.Транспорт.Обновить();
	
КонецПроцедуры
